cases/advection/2Dtranslation/lent-hex-translation2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./constant/caseSetup"

application     lentAdvect;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.5707963267948966;

deltaT          0.01;

writeControl    adjustableRunTime;
writeInterval   $endTime;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable no;

adjustTimeStep no;

maxCo $CFL;

maxAlphaCo 10; 

maxDeltaT       1;

libs ("libtwoPhaseValidation.so"); 

functions
{
    lentAdvect 
    {
        type divFree;
        divFree
        {
            type harmonic;
            baseType translation;

            V (1 1 0); 
            period $endTime; 
            phaseShift 0; 

            cellVelocityName U; 
            volFluxName phi; 
        }
    }
}


// ************************************************************************* //
